Blog.org
#+Title: Blog
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Date: 26 December 2019
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.
#+Options: toc:nil date:t num:nil html-style:nil html-postamble:t
#+export_file_name: docs/blog.html

* TODO Right adjoints are continuous                                                          :post:
:PROPERTIES:
:TITLE: Right adjoints are continuous
:EXPORT_FILE_NAME: homcontinuous.html
:INDEX_DATE: <2018-12-23 Sun>
:EXPORT_DATE: 23th December 2018
:END:

/This is an exercise on Abramsky and Tzevelekos' notes/
/on the course [[https://arxiv.org/pdf/1102.1313.pdf][Categories, Proofs and Processes]]./

*Proposition.* Let A be an object in the category *C*. Show that the covariant hom functor
C(A,-), preserves all limits.

/Proof./ Let *I* be a small category,  F : *I* -> *C* a functor and let L with the
morphisms lᵢ be the limit of that functor. We know that for every
morphism  ϕ : i -> j  in *I*, we have lⱼ = Fϕ ∘ lᵢ.

Let Z be a set with a family of morphisms fᵢ : Z -> C(a,Fi) determining
a cone to C(a,F-) : *I* -> *Sets*; that is, such that for each  ϕ : i -> j in *I*, we 
have that  fⱼ = (Fϕ ∘ -) ∘ fᵢ; or, in other words, for each z ∈ Z we have
fⱼ(z) = Fϕ ∘ fᵢ(z). Thus, fixing any  z ∈ Z gives as a family of morphisms
fᵢ(z) ∈ C(a,Fi) defining a cone.  This implies that there exists some
unique morphism ψ(z) : A -> L  such that  lᵢ ∘ a(z) = fᵢ(z).

Repeating this for every z ∈ Z we have obtained a function  a : Z -> C(A,L)
with the property lᵢ ∘ a = fᵢ. This function must be the unique one with this
property, because for any other  a' : Z -> C(A,L), for each z ∈  
we would have lᵢ ∘ a'(z) = fᵢ(z) and that would imply that a'(z) = a(z).

\\

*Proposition.* Right adjoints preserve limits.

/Proof./ (From Awodey 2010) Let  L : *C* -> *D*  and  R : *D* -> *C* be a pair of adjoints
L ⊣ R. Let Xᵢ be objects determining any diagram and Y an arbitrary object.
We have the following chain of natural transformations between
hom-sets.

#+BEGIN_SRC haskell
  hom(Y , R lim Xᵢ) ≅
  hom(L Y , lim Xᵢ) ≅
  lim hom(L Y , Xᵢ) ≅
  lim hom(Y , R Xᵢ) ≅
  hom(Y , lim R Xᵢ)
#+END_SRC

By Yoneda Lemma, this means R lim Xᵢ ≅ lim RXᵢ.

