homcontinuous.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-24 Mon 12:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Right adjoints are continuous</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="blog.html">Mario Román</a>
</div>
<div id="navigation">
<a href="about.html">About</a>
<a href="blog.html">Blog</a>
<a href="math.html">Math</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Right adjoints are continuous</h1>
<p>
<i>This is an exercise on Abramsky and Tzevelekos' notes</i>
<i>on the course <a href="https://arxiv.org/pdf/1102.1313.pdf">Categories, Proofs and Processes</a>.</i>
</p>

<p>
<b>Proposition.</b> Let A be an object in the category <b>C</b>. Show that the covariant hom functor
C(A,-), preserves all limits.
</p>

<p>
<i>Proof.</i> Let <b>I</b> be a small category,  F : <b>I</b> -&gt; <b>C</b> a functor and let L with the
morphisms lᵢ be the limit of that functor. We know that for every
morphism  ϕ : i -&gt; j  in <b>I</b>, we have lⱼ = Fϕ ∘ lᵢ.
</p>

<p>
Let Z be a set with a family of morphisms fᵢ : Z -&gt; C(a,Fi) determining
a cone to C(a,F-) : <b>I</b> -&gt; <b>Sets</b>; that is, such that for each  ϕ : i -&gt; j in <b>I</b>, we 
have that  fⱼ = (Fϕ ∘ -) ∘ fᵢ; or, in other words, for each z ∈ Z we have
fⱼ(z) = Fϕ ∘ fᵢ(z). Thus, fixing any  z ∈ Z gives as a family of morphisms
fᵢ(z) ∈ C(a,Fi) defining a cone.  This implies that there exists some
unique morphism ψ(z) : A -&gt; L  such that  lᵢ ∘ a(z) = fᵢ(z).
</p>

<p>
Repeating this for every z ∈ Z we have obtained a function  a : Z -&gt; C(A,L)
with the property lᵢ ∘ a = fᵢ. This function must be the unique one with this
property, because for any other  a' : Z -&gt; C(A,L), for each z ∈  
we would have lᵢ ∘ a'(z) = fᵢ(z) and that would imply that a'(z) = a(z).
</p>

<p>
<br />
</p>

<p>
<b>Proposition.</b> Right adjoints preserve limits.
</p>

<p>
<i>Proof.</i> (From Awodey 2010) Let  L : <b>C</b> -&gt; <b>D</b>  and  R : <b>D</b> -&gt; <b>C</b> be a pair of adjoints
L ⊣ R. Let Xᵢ be objects determining any diagram and Y an arbitrary object.
We have the following chain of natural transformations between
hom-sets.
</p>

<div class="org-src-container">
<pre class="src src-haskell">  hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Y</span> , <span style="color: #ce537a; font-weight: bold;">R</span> lim <span style="color: #ce537a; font-weight: bold;">X&#7522;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&#8773;</span>
  hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">L</span> <span style="color: #ce537a; font-weight: bold;">Y</span> , lim <span style="color: #ce537a; font-weight: bold;">X&#7522;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&#8773;</span>
  lim hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">L</span> <span style="color: #ce537a; font-weight: bold;">Y</span> , <span style="color: #ce537a; font-weight: bold;">X&#7522;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&#8773;</span>
  lim hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Y</span> , <span style="color: #ce537a; font-weight: bold;">R</span> <span style="color: #ce537a; font-weight: bold;">X&#7522;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&#8773;</span>
  hom<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Y</span> , lim <span style="color: #ce537a; font-weight: bold;">R</span> <span style="color: #ce537a; font-weight: bold;">X&#7522;</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
By Yoneda Lemma, this means R lim Xᵢ ≅ lim RXᵢ.
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 23th December 2018. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
